#1) შევქმნათ ლისტი სადაც შევინახავთ ტქვენი მშობლების სახელებს, და ბოლოში ჩაამატეთ თქვენი სახელიც

family = ["deda", "mama"]

family.append("ale")
print(family)

#2) შექმენით რიცხვების სია. გადაუარეთ მას for ციკლითი. შეამოწმეთ თუ რიცხვი ლუწია დაბეჭდეთ "Number is even", სხვა შემთხვევაში "Number is Odd"

num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

for i in num:
    if i % 2 == 0:
        print (i, "is odd")
    else:
        print (i, "is even")


#3) შექმენით სიტყვების სია 10 ელემენტისგან. გადაუარეთ for ციკლით ამ სიას ისე, რომ დაბეჭდოთ ყოველი მე-2 ელემენტი(დაგჭირდებათ slicing-ი)

list = ["kasper", "ale", 'anano', 'gabu', 'grdzelo', 'haakoni', 'taso', 'nia', 'spotify', 'demon slayer']

for i in list:
    print(list[::2])

#4) შექმენით ცვლადი, სადაც შეინახავთ სიტყვას. გადაუარეთ მას for ციკლით, დაბეჭდეთ მისი თითოეული სიმბოლო და გვერდით მიუწერეთ მისი რიგის ნომერი string-ში(ანუ მერამდენე სიმბოლოა)
#მაგალითად: academy = "GOA"
#"G-1"
#"O-2"
#"A-3"

doggy= "dog"

for index in range(len(doggy)):
    print({doggy[index]}-{index + 1})

#5) მოიძიეთ, როგორ შეიძლება სიის შემოტრიალება, შემდეგ შექმენით სია და დაბეჭდეთ ის შემოტრიალებულად. მაგალითად: [1,2] -> [2,1]

list = ["kasper", "ale"]
print(list[::-1])