#1) შექმენი ფუნქცნია lion() სადაც  5 ელემენტიანი მასივი რომელიშ გამოიყენებთ .index() მეთოდს
# array = ["kasper", "lomi", "ale", "kvati", "mizi"]

# def lion(a):
#     return array.index(a)
# print(lion("kvati"))

#-------------------------------------------------------------
#2) შექმენი ფუნქცნია lion2() სადაც შექმენი 5 ელემენტიანი მასივი [1,1,1,1,1,1,1,2] რომელიშ გამოიყენებთ .index() მეთოდს და მიწვდებით ბოლო ელემენტს მხოლოდ index() !!!


array1 = [1,1,1,1,1,1,1,2]

def lion2(b):
    return array1.index(b)
print(lion2(2))